let fullGenshinCharceter = ["Хэйдьзо","Синобу","Шань Хэ","Е лань","Аято","Яэ Мико","Юнь Цзынь","Итто","Горо","Тома","Кокоми","Райден","Сара","Элой","Ёимия","Саю","Аяка","Кадзуха","Эола","Янь Фей","Розария","Ху Тао","Щяо","Коза","Альбедо","Дед","Синь Янь","Торт","Диона","Кли","Анемо архонт","ГГ","Ке цын","Мона","Чича","дилюк","Джин","Сахар","Чугунь","Ноэль","Пиро архонт","Фишль","Нинка","Синий","Бей Доууууу","Сянка","Разор","Барбара","Лиза","Кейа","Ембер"]


function onClickGenhsin () {
 for( let keys in fullGenshinCharceter) {
   
    var RandGenshin = fullGenshinCharceter[Math.floor(Math.random()*fullGenshinCharceter.length)];
    
 };
    alert(RandGenshin);
    
};
                                                                                                                                             